Repository: acastrodev/stride-docs-catproject
Catalog: stride-docs-level2.tmx
Source language: en
Languages: pt_br

source: 404 - Page or File Not Found
pt_br: 404 - Página ou Arquivo Não Encontrado

source: !CAUTION If you have completed the Deployment Tab process, ensure that the deployment profile includes the DeleteExistingFiles property.
pt_br: !CAUTION Se você concluiu o processo da aba Implantação, certifique-se de que o perfil de implantação inclua a propriedade DeleteExistingFiles.

source: !IMPORTANT SEO Note: Ensure that the file name includes essential keywords related to the content of the article.
pt_br: !IMPORTANT Nota de SEO: Certifique-se de que o nome do arquivo inclua palavras-chave essenciais relacionadas ao conteúdo do artigo.

source: !IMPORTANT Prioritize the use of Bootstrap's inherent styling before integrating any custom styles.
pt_br: !IMPORTANT Priorize o uso dos estilos nativos do Bootstrap antes de aplicar quaisquer estilos personalizados.

source: !NOTE If multiple labels are applied, the release automation will prioritize the generic category first, followed by the Stride-specific category.
pt_br: !NOTE Se múltiplos rótulos forem aplicados, a automação de versão priorizará a categoria genérica primeiro, seguida pela específica do Stride.

source: !NOTE The deployment process outlined here is already established and running, hosted on Azure and sponsored by the .NET Foundation.
pt_br: !NOTE O processo de implantação descrito aqui já está estabelecido e em execução, hospedado no Azure e patrocinado pela .NET Foundation.

source: !NOTE This guide assumes that you are already familiar with updating files on GitHub.
pt_br: !NOTA Este guia parte do princípio de que você já está familiarizado com a atualização de arquivos no GitHub.

source: 2D Game Tutorial UI
pt_br: Tutorial de interface para Jogo 2D

source: 2D Game Tutorial
pt_br: Tutorial de jogo 2D

source: 2D camera system
pt_br: Sistema de câmera 2D

source: 3D UI using Stride and VVVV
pt_br: Interface 3D usando Stride e VVVV

source: 3D rendering documentation
pt_br: Documentação de renderização

source: A Minecraft-style game
pt_br: Jogo estilo Minecraft

source: Additional Contributions?: Consider whether you want to make further contributions.
pt_br: Gostaria de contribuir mais?: Avalie se deseja fazer novas contribuições.

source: Address PR Feedback: If maintainers or other contributors have feedback, make the necessary adjustments to your PR.
pt_br: Responda ao feedback do PR: Caso receba sugestões ou observações dos mantenedores ou de outros colaboradores, ajuste seu PR conforme necessário.

source: Alert: These are block quotes that render with distinct colors and icons, highlighting the importance or nature of the content
pt_br: Alertas: Blocos de citação com cores e ícones distintos, destacando a importância ou natureza do conteúdo.

source: Animation Trigger script
pt_br: Script de acionadores de animação

source: Arch ECS integrated into Stride
pt_br: Arch ECS integrado ao Stride

source: Async shader compilation
pt_br: Compilação assíncrona de shader

source: AutoImportStride: A script to import files into Stride3D.
pt_br: AutoImportStride: Um script para importar arquivos para o Stride.

source: Basic Platformer Movement Tutorial
pt_br: Tutorial de movimento básico de plataforma

source: Basic Platformer WIP
pt_br: Jogo de plataforma básico (Em progresso)

source: Basic Stride LOD system
pt_br: Sistema básico de LOD do Stride

source: Bepu Navigation using DotRecast
pt_br: Bepu Navigation usando DotRecast

source: Bepu Physics in Stride
pt_br: Física Bepu no Stride

source: Bepu physics integration
pt_br: Integração da física Bepu

source: Blender plugin to export bulk anims for importing into Stride
pt_br: Plugin do Blender para exportar animações em massa para importação no Stride

source: Boids algorithm rendered in Stride
pt_br: Algoritmo de Boids renderizado no Stride

source: Bullet physics constraints in Stride
pt_br: Restrições de física Bullet no Stride

source: Bump in to some useful code
pt_br: Encontre aquele código útil que estava procurando!

source: Camera controller
pt_br: Controlador de câmera

source: Checklist: A series of verification steps to ensure the PR is comprehensive and tested.
pt_br: Checklist: Itens de verificação para garantir completude e testes.

source: Clean UI with no Post FX in Game Studio and Game
pt_br: Interface limpa sem efeitos de pós-processamento no Game Studio e no jogo

source: ClientServerSample - Headless server (Physics only, no game tick loop)
pt_br: ClientServerSample - Servidor sem interface gráfica (apenas física, sem loop de jogo)

source: Code Generator for Stride - Day 1
pt_br: Gerador de código para Stride - Dia 1

source: Code Generator for Stride - Day 2
pt_br: Gerador de código para Stride - Dia 2

source: Code Generator for Stride - Day 3
pt_br: Gerador de código para Stride - Dia 3

source: Code Snippet: Insert code snippets for better clarity and demonstration
pt_br: Trecho de código: Insere trechos de código para melhor clareza e demonstração.

source: CodeOnlySample - Sample project with code only
pt_br: CodeOnlySample - Projeto de exemplo apenas com código

source: Compiling Stride for Linux
pt_br: Compilando o Stride para Linux

source: Compiling Stride with Vulkan to debug local changes on Linux
pt_br: Compilando o Stride com Vulkan para depurar alterações locais no Linux

source: Control - Input Manager
pt_br: Gerenciador de entrada – controle

source: Create a Branch 'X': Create a new branch in your forked repository, naming it appropriately for the changes you plan to implement.
pt_br: Crie um branch 'X': No seu fork, crie um novo branch, nomeando-o de forma apropriada para refletir as alterações que pretende fazer.

source: Create a Pull Request (PR): Once satisfied with your changes and testing, submit a pull request to the original repository for review.
pt_br: Crie um pull request (PR): Quando estiver satisfeito com suas alterações e os testes, submeta um pull request para o repositório original.

source: Create a custom data asset
pt_br: Criar um asset de dados personalizado

source: Create button dynamically
pt_br: Criar botão dinamicamente

source: Creating a procedural model
pt_br: Criando um modelo procedural

source: Creating an issue is required for major updates, so that others can comment on your changes and provide feedback.
pt_br: Para atualizações significativas, é obrigatório criar uma issue, para que outros possam comentar e oferecer sugestões.

source: Custom Editor Gizmos
pt_br: Gizmos personalizados no editor

source: Custom Root Renderer
pt_br: Renderizador base personalizado

source: Custom UI example using MyraUI
pt_br: Exemplo de interface personalizada usando Myra UI

source: CustomRootRenderer - Render custom shaders correctly into a scene
pt_br: CustomRootRenderer - Renderize shaders personalizados corretamente em uma cena

source: Cutscene Timeline
pt_br: Linha do tempo para cutscenes

source: Data Sculpture for Herrenknecht rendered with Stride
pt_br: Escultura de Dados para Herrenknecht renderizada com Stride

source: Debug shape render
pt_br: Depuração de renderização de formas

source: Demos with a focus on Code-Only approach
pt_br: Demos focadas na abordagem somente com código

source: Description: An in-depth explanation of what has been changed or added.
pt_br: Descrição: Explicação detalhada do que foi feito.

source: Descriptive Information: Comments should clearly describe the purpose, parameters, return values, and any exceptions thrown by the method or property.
pt_br: Informações descritivas: Os comentários devem descrever claramente o propósito, os parâmetros, os valores de retorno e quaisquer exceções lançadas pelo método ou propriedade.

source: Distant Worlds 2 - Vast, pausable real-time 4X space strategy game
pt_br: Distant Worlds 2 - Jogo de estratégia espacial 4X em tempo real, pausável

source: Doprez.Stride.AI: FSM and GOAP library for Stride
pt_br: Doprez.Stride.AI: Biblioteca de FSM e GOAP para Stride

source: Dozer Dash - made with a code only approach plus repo
pt_br: Dozer Dash - feito com uma abordagem somente código mais repositório

source: ET-Stride: A networking framework based on Stride and ET
pt_br: ET-Stride: Um framework de rede baseado em Stride e ET

source: Easier input binding configuration
pt_br: Mapeamento de entrada mais fácil de configurar

source: Emanuel-DIY Follow Along Project
pt_br: Projeto passo a passo com Emanuel-DIY

source: Empty Keys UI for Xenko
pt_br: Empty Keys UI para Xenko

source: End: Conclude your current contribution cycle.
pt_br: Fim: Finalize o ciclo de contribuição atual.

source: Entity Processor Example - Custom Entity Component + Processor
pt_br: Exemplo de Processador de Entidade - Componente de entidade personalizado + processador

source: Entity Processor
pt_br: Processador de entidade

source: Experimental mini Stride.Editor in Avalonia
pt_br: Mini editor experimental do Stride em Avalonia

source: Explore games and demos
pt_br: Explore jogos e demos!

source: Explore tutorials and articles
pt_br: Explore os tutoriais e artigos!

source: Export/save a scene or a group of entities within a running stride game
pt_br: Exportar/salvar uma cena ou grupo de entidades em tempo de execução

source: FPS Infinite - Procedural FPS with VR support
pt_br: FPS Infinite - FPS procedural com suporte para VR

source: Flappy Bird With Source Code
pt_br: Flappy Bird com código fonte

source: FlowingWater - Flowing water shader implementation
pt_br: FlowingWater - Implementação de shader de água fluida

source: Fog Of War
pt_br: Névoa de guerra

source: Fork the Repository: Begin by forking the repository of the project you're interested in contributing to.
pt_br: Faça um fork do repositório: Comece fazendo um fork do repositório do projeto com o qual deseja contribuir.

source: GalaxyCore: Network Solution for Unity, Stride, Xenko, Unigine
pt_br: GalaxyCore: Solução de rede para Unity, Stride, Xenko, Unigine

source: Game Screen Manager
pt_br: Gerenciador de telas de Jogo

source: Generate simple mesh and marching cube from computeShader
pt_br: Geração de malha simples e marching cube a partir de computeShader

source: Generic categories:
pt_br: Categorias genéricas:

source: Get Vertices and Indices from a mesh
pt_br: Obtendo vértices e Índices de uma malha

source: Get your feet wet
pt_br: É hora de molhar os seus pés!

source: Glass shader
pt_br: Shader de vidro

source: Glasses - Global Game Jam Entry
pt_br: Glasses - Jogo submetido na Global Game Jam

source: Harrowing Flight - Student Game Project
pt_br: Harrowing Flight - Projeto de jogo de estudante

source: Has the Upstream Changed?: Regularly check if the original repository has been updated.
pt_br: Garanta que suas modificações estejam em conformidade com os padrões e diretrizes do projeto.

source: Have a look
pt_br: Dê uma olhada!

source: How To setup Real Time Voxel Global Illumination
pt_br: Como configurar iluminação global voxel em tempo real

source: How to create custom configuration in Stride
pt_br: Como criar configurações personalizadas no Stride

source: How to use locally built Stride Engine to debug your game
pt_br: Como usar o Stride compilado localmente para depurar seu jogo

source: ImGuiDebug - Bare-bone implementation of ImGui and a couple of debug tools for Stride
pt_br: ImGuiDebug – Implementação mínima do ImGui com algumas ferramentas de depuração para o Stride

source: Image processing shaders from VVVV community
pt_br: Shaders de processamento de imagem da comunidade VVVV

source: Image: Insert images to enhance the visual aspect of the documentation
pt_br: Imagem: Insere imagens para melhorar o aspecto visual da documentação.

source: Import files into Stride3D
pt_br: Importar arquivos para o Stride

source: Import some knowledge
pt_br: Importe um pouco de conhecimento!

source: Include Markdown Files: Include content from other markdown files seamlessly
pt_br: Incluir arquivos markdown: Inclui conteúdo de outros arquivos markdown de forma transparente.

source: Key Points for API Documentation:
pt_br: Pontos-chave da documentação da API:

source: LOD implementation
pt_br: Implementação de LOD

source: Large-scale interactive projects made with VVVV
pt_br: Projetos interativos em grande escala feitos com VVVV

source: Level Editor Extensions
pt_br: Extensões para editor de fases

source: Lights, camera, Action!
pt_br: Luzes, câmera, ação!

source: Load Scenes in parallel
pt_br: Carregamento de cenas em paralelo

source: LoadObjTest - Runtime load an asset from a filesystem WavefrontOBJ file in code.
pt_br: LoadObjTest - Carrega em tempo de execução um asset de um arquivo Wavefront OBJ do sistema de arquivos no código.

source: Loading GLTF at runtime
pt_br: Carregando GLTF em tempo de execução

source: Loading a Wavefront OBJ file at runtime
pt_br: Carregando um arquivo Wavefront OBJ em tempo de execução

source: Loading additional asset databases
pt_br: Carregando bancos de dados de adicional de asset

source: Look at script
pt_br: Script de olhar para o alvo

source: MUD framework for Stride
pt_br: Framework MUD para Stride

source: Maintainers Review: The project maintainers will review your PR.
pt_br: Revisão dos mantenedores: Os mantenedores do projeto irão revisar seu PR.

source: Make Updates on Branch 'X': Implement your changes within this new branch.
pt_br: Realize as alterações no branch 'X': Implemente suas mudanças neste novo branch.

source: Marching Cubes ComputeShader
pt_br: ComputeShader e marching cubes

source: Math Expressions: Integrate mathematical notations and expressions
pt_br: Expressões matemáticas: Integra notações e expressões matemáticas.

source: Mermaid Diagrams: Embed mermaid diagrams for flowcharts and other graphical representations
pt_br: Diagramas Mermaid: Incorpora diagramas mermaid para fluxogramas e outras representações gráficas.

source: Microsoft.Extensions.Hosting.Stride3d: Hosting lifetime for Stride3d
pt_br: Microsoft.Extensions.Hosting.Stride3d: Hosting lifetime para o Stride

source: Motivation and Context: The reasoning behind the changes.
pt_br: Motivação e contexto: O porquê das mudanças.

source: Multi-Mesh Shader
pt_br: Shader multi-malha

source: Multiplayer
pt_br: Multijogador

source: Myra UI - Library for Stride
pt_br: Myra UI - Biblioteca para Stride

source: Myra UI - Stride Tutorial
pt_br: Myra UI - Tutorial Stride

source: Networking from Scythe of Luna
pt_br: Sistema de rede do Scythe of Luna

source: New Stride version
pt_br: Nova versão do Stride

source: No shady stuff here, we promise
pt_br: Shaders, shaders, shaders!

source: Object Info Render Target Example - Renders object information onto a render target
pt_br: Exemplo de Alvo de Renderização de Informações de Objeto - Renderiza informações de objetos em um alvo de renderização

source: Object Info Renderer
pt_br: Renderizador de informações de objeto

source: Old Stride tutorials from gamefromscratch
pt_br: Tutoriais antigos do Stride do GameFromScratch

source: Old: Debug shape render
pt_br: Antigo: Depuração de renderização de formas

source: Once Upon A Lan - Multiplayer isometric arena brawler over LAN
pt_br: Once Upon A Lan - Brawler multijogador isométrico via LAN

source: Once Upon a LAN by Jarmo
pt_br: Once Upon a LAN por Jarmo

source: Pathfinding With Entity Processors
pt_br: Pathfinding com processadores de entidade

source: Physics constraints demo
pt_br: Demonstração de restrições físicas

source: Plug in and play
pt_br: É só conectar e usar!

source: Procedural Meshes
pt_br: Malhas procedurais

source: Proof of Concepts
pt_br: Provas de conceito

source: Quake 3 movement for Stride3D
pt_br: Movimentação estilo Quake 3 no Stride3D

source: Regulus.Remote: A simple C# network library.
pt_br: Regulus.Remote: Uma biblioteca de rede simples em C#

source: Related Issue: Linking to discussions or bug reports related to the PR.
pt_br: Issue relacionado: Links para bugs ou discussões relacionadas.

source: Render objects with invisible background window
pt_br: Renderizar objetos com janela de fundo invisível

source: Rescue Drone - August 2015
pt_br: Rescue Drone - Agosto de 2015

source: Revise and Update PR as Necessary: Continue to refine and update your PR based on ongoing feedback until it meets the project's standards for merging.
pt_br: Revise e atualize o PR se necessário: Continue ajustando seu PR até que ele atenda aos padrões do projeto e esteja pronto para ser mesclado.

source: Rollerghoster - Race against online and local ghosts on procedural tracks by Aggror Jorn
pt_br: Rollerghoster - Corrida contra fantasmas online e locais em pistas procedurais, por Aggror Jorn

source: Run Stride Gamestudio with only Nuget!
pt_br: Execute o Stride Game Studio apenas com Nuget!

source: Running Stride headless client/server
pt_br: Executando Stride como cliente/servidor sem interface gráfica

source: SDSL Overview from Tebjan
pt_br: Visão geral do SDSL por Tebjan

source: Screen Space Decal Example - Screen space projected decal system
pt_br: Exemplo de Decalque em Espaço de Tela - Sistema de decalque projetado em espaço de tela

source: Screen Space Decal Root Renderer Example - Screen space projected decal system using RootRenderFeature
pt_br: Exemplo de Renderizador Raiz de Decalque em Espaço de Tela - Sistema de decalque projetado em espaço de tela usando RootRenderFeature

source: Screen Space Decals With Root Renderer
pt_br: Decais em espaço de tela com renderizador base

source: Screen Space Decals
pt_br: Decais em espaço de tela (Espaço da Tela)

source: ShaderExplorerForStride - Explore Stride source shader implementations
pt_br: ShaderExplorerForStride - Explore implementações dos shaders no código fonte do Stride

source: Simple water 2
pt_br: Água simples 2

source: Simple water
pt_br: Água simples

source: Singleton Pattern in Stride
pt_br: Padrão Singleton no Stride

source: Smooth Rotation
pt_br: Rotação suave

source: Smooth follow
pt_br: Seguir suavemente

source: Sound detection in Stride
pt_br: Detecção de som no Stride

source: Source generation
pt_br: Geração de código-fonte

source: SplitScreen
pt_br: Tela dividida

source: SpriteSheet animation tutorial
pt_br: Tutorial de animação com SpriteSheet

source: Starbreach - First/Third Person Shooter
pt_br: Starbreach - Atirador em primeira/pessoa terceira

source: Start connecting the dots
pt_br: Ligando os pontos!

source: Step up Made by Marian Dziubiak and Youness Kafia
pt_br: Step up feito por Marian Dziubiak e Youness Kafia

source: Stopping the Rogue by manio
pt_br: Stopping the Rogue por manio

source: Storing game data with an API
pt_br: Armazenando dados do jogo com uma API

source: Stride 3rd person controller
pt_br: Controlador de terceira pessoa no Stride

source: Stride C# gists search
pt_br: Busca por gists em C# com Stride

source: Stride Clean UI tutorial step by step
pt_br: Tutorial de interface limpa no Stride passo a passo

source: Stride Editor current design document
pt_br: Documento do atual design do Editor Stride

source: Stride Game Engine Extension for code only approach
pt_br: Extensão do motor de jogos Stride para abordagem somente com código

source: Stride IK implementation
pt_br: Implementação de IK no Stride

source: Stride Instancing Example
pt_br: Exemplo de instanciação no Stride

source: Stride Live Editor for changing entity data at runtime
pt_br: Editor em tempo real do Stride para alterar dados de entidade em tempo de execução

source: Stride Outline Renderer
pt_br: Renderizador de contorno do Stride

source: Stride Ragdoll Tutorial (beta)
pt_br: Tutorial de ragdoll no Stride (beta)

source: Stride Voxel Scape
pt_br: Voxel Scape no Stride

source: Stride config example
pt_br: Exemplo de configuração do Stride

source: Stride controller UI navigation
pt_br: Navegação de interface com controle no Stride

source: Stride docs shader stages
pt_br: Documentação do Stride sobre estágios de shader

source: Stride in Avalonia Control
pt_br: Stride em Avalonia

source: Stride in Ultralight Blazor
pt_br: Stride no Ultralight Blazor

source: Stride in WPF Control
pt_br: Stride em WPF

source: Stride in WinForms
pt_br: Stride no WinForms

source: Stride integration source code on GitHub
pt_br: Código-fonte da integração do Stride no GitHub

source: Stride-Awesome-Shaders: Just a repository for cool shaders usable in stride
pt_br: Stride-Awesome-Shaders: Um repositório para shaders interessantes que podem ser utilizados no Stride

source: Stride-goap: a very simple implementation of GOAP using MountainGoap
pt_br: Stride-goap: Implementação simples de GOAP usando MountainGoap

source: Stride-npc: A basic example of a Finite State Machine
pt_br: Stride-npc: Exemplo básico de uma máquina de estados finitos

source: Stride-specific categories:
pt_br: Categorias específicas do Stride:

source: Stride.Networking.Simple - Asynchronous NetworkScript example for client-server communication
pt_br: Stride.Networking.Simple - Exemplo de NetworkScript assíncrono para comunicação cliente-servidor

source: Stride.ShaderExplorer: shows the built-in shaders of the Stride
pt_br: Stride.ShaderExplorer: Visualize os shaders integrados do Stride

source: Stride3D examples in .NET 5 using C# 9.0 or .NET 6 using C# 10
pt_br: Exemplos do Stride3D em .NET 5 com C# 9.0 ou .NET 6 com C# 10

source: Stride3dSplitScreen - Another Split Screen
pt_br: Stride3dSplitScreen - Outra tela dividida

source: StrideCameraController - Swapping Cameras/Resident Evil Style
pt_br: StrideCameraController - Troca de câmeras estilo Resident Evil

source: StrideFogOfWarPlus - Moba/Platformer/RTS FogOfWar System (no LoS)
pt_br: StrideFogOfWarPlus - Sistema de Névoa de Guerra para Moba/Plataforma/RTS (sem LoS)

source: StrideMeshOutlineRenderFeature: Stride Mesh Outline Render Feature
pt_br: StrideMeshOutlineRenderFeature: Recurso de renderização de contorno de malha para o Stride

source: StrideMeshOutlineRenderFeature - Mesh Outline Render Feature
pt_br: StrideMeshOutlineRenderFeature - Recurso de renderização de contorno de Malha

source: StrideTerrain - Height Map Terrain
pt_br: StrideTerrain - Terreno com mapa de altura

source: StrideTriplanarShader - Triplanar Shader for Stride
pt_br: StrideTriplanarShader - Shader triplanar para o Stridec

source: StrideWireframeShader: single pass wireframe shader for stride
pt_br: StrideWireframeShader: shader aramado de passe único para o Stride

source: Stridelonia: Stride plugin which allows running Avalonia on Stride
pt_br: Stridelonia: Plugin do Stride que permite rodar Avalonia no Stride

source: Strideui discussion
pt_br: Discussão sobre o StrideUI

source: Summary: A brief overview of the changes.
pt_br: Resumo: Uma visão geral rápida das alterações.

source: Super Character Controller
pt_br: Super controlador de personagem

source: Svelto Abstraction from OOP
pt_br: Abstraindo Svelto utilizando POO

source: Svelto Doofuses example
pt_br: Exemplo Doofuses com Svelto

source: Svelto ECS mini examples
pt_br: Mini exemplos utilizando Svelto ECS

source: Svelto Turret example
pt_br: Exemplo de torretas com Svelto

source: Sync/Merge Forked Main Branch with Branch 'X': Ensure your working branch 'X' is also updated with any new changes from the main branch of your fork.
pt_br: Sincronize/Mescle o branch main do fork com o branch 'X': Mantenha também seu branch de trabalho atualizado com as alterações mais recentes do seu branch principal.

source: Sync/Merge Upstream with Forked Main Branch: If the upstream has changed, update your forked repository's main branch to reflect the latest changes from the original project.
pt_br: Sincronize/Mescle o repositório original com o seu fork (branch main): Caso existam atualizações, aplique-as ao seu fork para mantê-lo atualizado com o projeto original.
